console.log('whileAndFor');

//1. Выведите столбец чисел от 1 до 50. (в консоль и в документ html с помощью document.write) Использовать два типа циклов, while и for                                                     



//2. Выведите столбец чисел от 1 до 100.



//3. Выведите столбец чисел от 11 до 33.



//4. Выведите столбец четных чисел в промежутке от 0 до 100.



//5. С помощью цикла найдите сумму чисел от 1 до 100.     



// 6. Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.


